Autodesk.Revit.DB.FabricationConfiguration.UnloadServices(System.Collections.Generic.IList{System.Int32})
Unload the specified fabrication services from the project.
serviceIds:
The ids of the fabrication services to unload.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication services can not be unloaded if they are in use currently.
-or-
Some services are not loaded yet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication workspace is not connected and updated to source configuration, please reload and try again.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.LoadServices(System.Collections.Generic.IList{System.Int32})
Loads the specified fabrication services into the project.
serviceIds:
The ids of the fabrication services to load.
Returns:
The ids of the fabrication services wich are failed to load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication workspace is not connected and updated to source configuration, please reload and try again.
-or-
this operation failed.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.ReloadConfiguration
Reloads the fabrication configuration from its source fabrication configuration.
Remarks:
The configuration must be reloaded from its source fabrication configuration before loading new fabrication services.
Returns:
The information about the reload of the fabrication configuration.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The fabrication configuration is not set yet.
-or-
this operation failed.
Since:
2016